u-blox/cellular/port/platform/stm/stm32f4/src/cellular_port_uart.c
/*
 * Copyright 2020 u-blox Cambourne Ltd
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
    http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifdef CELLULAR_CFG_OVERRIDE
# include "cellular_cfg_override.h" // For a customer's configuration override
#endif
#include "cellular_cfg_sw.h"
#include "cellular_cfg_hw_platform_specific.h"
#include "cellular_port_debug.h"
#include "cellular_port_clib.h"
#include "cellular_port.h"
#include "cellular_port_os.h"
#include "cellular_port_uart.h"

#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_gpio.h"
#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_usart.h"

#include "cmsis_os.h"

#include "cellular_port_private.h"  // Down here 'cos it needs GPIO_TypeDef

/* The code here was written using the really useful information
 * here:
 * *
 * https://stm32f4-discovery.net/2017/07/stm32-tutorial-efficiently-receive-uart-data-using-dma/
 * *
 * This code uses the LL API, as that tutorial does, and sticks
 * to it exactly, hence where the LL API has a series of
 * named functions rather than taking a parameter (e.g.
 * LL_DMA_ClearFlag_HT0(), LL_DMA_ClearFlag_HT1(), etc.)
 * the correct function is accessed through a jump table,
 * making it possible to use it in a parameterised manner
 * again.
 */

/* ----------------------------------------------------------------
 * COMPILE-TIME MACROS
 * -------------------------------------------------------------- */

// The maximum number of UART HW blocks on an STM32F4.
#define CELLULAR_PORT_MAX_NUM_UARTS 8

// The maximum number of DMA engines on an STM32F4.
#define CELLULAR_PORT_MAX_NUM_DMA_ENGINES 2

// The maximum number of DMA streams on an STM32F4.
#define CELLULAR_PORT_MAX_NUM_DMA_STREAMS 8

// Determine if the given DMA engine is in use
#define CELLULAR_PORT_DMA_ENGINE_IN_USE(x) (((CELLULAR_CFG_UART1_AVAILABLE != 0) && (CELLULAR_CFG_UART1_DMA_ENGINE == x)) || \
                                            ((CELLULAR_CFG_UART2_AVAILABLE != 0) && (CELLULAR_CFG_UART2_DMA_ENGINE == x)) || \
                                            ((CELLULAR_CFG_UART3_AVAILABLE != 0) && (CELLULAR_CFG_UART3_DMA_ENGINE == x)) || \
                                            ((CELLULAR_CFG_UART4_AVAILABLE != 0) && (CELLULAR_CFG_UART4_DMA_ENGINE == x)) || \
                                            ((CELLULAR_CFG_UART5_AVAILABLE != 0) && (CELLULAR_CFG_UART5_DMA_ENGINE == x)) || \
                                            ((CELLULAR_CFG_UART6_AVAILABLE != 0) && (CELLULAR_CFG_UART6_DMA_ENGINE == x)) || \
                                            ((CELLULAR_CFG_UART7_AVAILABLE != 0) && (CELLULAR_CFG_UART7_DMA_ENGINE == x)) || \
                                            ((CELLULAR_CFG_UART8_AVAILABLE != 0) && (CELLULAR_CFG_UART8_DMA_ENGINE == x)))

// Determine if the given DMA stream is in use
#define CELLULAR_PORT_DMA_STREAM_IN_USE(x) (((CELLULAR_CFG_UART1_AVAILABLE != 0) && (CELLULAR_CFG_UART1_DMA_STREAM == x)) || \
                                            ((CELLULAR_CFG_UART2_AVAILABLE != 0) && (CELLULAR_CFG_UART2_DMA_STREAM == x)) || \
                                            ((CELLULAR_CFG_UART3_AVAILABLE != 0) && (CELLULAR_CFG_UART3_DMA_STREAM == x)) || \
                                            ((CELLULAR_CFG_UART4_AVAILABLE != 0) && (CELLULAR_CFG_UART4_DMA_STREAM == x)) || \
                                            ((CELLULAR_CFG_UART5_AVAILABLE != 0) && (CELLULAR_CFG_UART5_DMA_STREAM == x)) || \
                                            ((CELLULAR_CFG_UART6_AVAILABLE != 0) && (CELLULAR_CFG_UART6_DMA_STREAM == x)) || \
                                            ((CELLULAR_CFG_UART7_AVAILABLE != 0) && (CELLULAR_CFG_UART7_DMA_STREAM == x)) || \
                                            ((CELLULAR_CFG_UART8_AVAILABLE != 0) && (CELLULAR_CFG_UART8_DMA_STREAM == x)))

/* ----------------------------------------------------------------
 * TYPES
 * -------------------------------------------------------------- */

/** A UART event.  Since we only ever need to signal
 * size or -1 then on this platform the CellularPortUartEventData_t
 * can simply be an int32_t.
 */
typedef int32_t CellularPortUartEventData_t;

/** Structure of the constant data per UART.
 */
typedef struct CellularPortUartConstData_t {
    USART_TypeDef *pReg;
    int32_t dmaEngine;
    int32_t dmaStream;
    int32_t dmaChannel;
    IRQn_Type irq;
} CellularPortUartConstData_t;

/** Structure of the data per UART.
 */
typedef struct CellularPortUartData_t {
    int32_t number;
    const CellularPortUartConstData_t * pConstData;
    CellularPortMutexHandle_t mutex;
    CellularPortQueueHandle_t queue;
    char *pRxBufferStart;
    char *pRxBufferRead;
    volatile char *pRxBufferWrite;
    bool userNeedsNotify; //!< set this if toRead has hit zero and
                          // hence the user would like a notification
                          // when new data arrives.
    struct CellularPortUartData_t *pNext;
} CellularPortUartData_t;

/* ----------------------------------------------------------------
 * VARIABLES
 * -------------------------------------------------------------- */

// Root of the UART linked list.
static CellularPortUartData_t *gpUartDataHead = NULL;

// Get the bus enable function for the given UART/USART.
static const void (*gLlApbClkEnable[])(uint32_t) = {0, // This to avoid having to -1 all the time
                                                    LL_APB2_GRP1_EnableClock,
                                                    LL_APB1_GRP1_EnableClock,
                                                    LL_APB1_GRP1_EnableClock,
                                                    LL_APB1_GRP1_EnableClock,
                                                    LL_APB1_GRP1_EnableClock,
                                                    LL_APB2_GRP1_EnableClock,
                                                    LL_APB1_GRP1_EnableClock,
                                                    LL_APB1_GRP1_EnableClock};

// Get the LL driver peripheral number for a given UART/USART.
static const int32_t gLlApbGrpPeriphUart[] = {0, // This to avoid having to -1 all the time
                                              LL_APB2_GRP1_PERIPH_USART1,
                                              LL_APB1_GRP1_PERIPH_USART2,
                                              LL_APB1_GRP1_PERIPH_USART3,
                                              LL_APB1_GRP1_PERIPH_UART4,
                                              LL_APB1_GRP1_PERIPH_UART5,
                                              LL_APB2_GRP1_PERIPH_USART6,
                                              LL_APB1_GRP1_PERIPH_UART7,
                                              LL_APB1_GRP1_PERIPH_UART8};

// Get the LL driver peripheral number for a given DMA engine.
static const int32_t gLlApbGrpPeriphDma[] = {0, // This to avoid having to -1 all the time
                                             LL_AHB1_GRP1_PERIPH_DMA1,
                                             LL_AHB1_GRP1_PERIPH_DMA2};

