u-blox/cellular/port/platform/stm/stm32f4/src/cellular_port_uart.c
// Get the DMA base address for a given DMA engine
static DMA_TypeDef * const gpDmaReg[] =  {0, // This to avoid having to -1 all the time
                                          DMA1,
                                          DMA2};

// Get the alternate function required on a GPIO line for a given UART.
// Note: which function a GPIO line actually performs on that UART is
// hard coded in the chip; for instance see table 12 of the STM32F437 data sheet.
static const int32_t gGpioAf[] = {0, // This to avoid having to -1 all the time
                                  LL_GPIO_AF_7,  /* UART 1 */
                                  LL_GPIO_AF_7,  /* UART 2 */
                                  LL_GPIO_AF_7,  /* UART 3 */
                                  LL_GPIO_AF_8,  /* UART 4 */
                                  LL_GPIO_AF_8,  /* UART 5 */
                                  LL_GPIO_AF_8,  /* UART 6 */
                                  LL_GPIO_AF_8,  /* UART 7 */
                                  LL_GPIO_AF_8}; /* UART 8 */

// Table of stream IRQn for DMA engine 1
static const IRQn_Type gDma1StreamIrq[] = {DMA1_Stream0_IRQn,
                                           DMA1_Stream1_IRQn,
                                           DMA1_Stream2_IRQn,
                                           DMA1_Stream3_IRQn,
                                           DMA1_Stream4_IRQn,
                                           DMA1_Stream5_IRQn,
                                           DMA1_Stream6_IRQn,
                                           DMA1_Stream7_IRQn};

// Table of stream IRQn for DMA engine 2
static const IRQn_Type gDma2StreamIrq[] = {DMA2_Stream0_IRQn,
                                           DMA2_Stream1_IRQn,
                                           DMA2_Stream2_IRQn,
                                           DMA2_Stream3_IRQn,
                                           DMA2_Stream4_IRQn,
                                           DMA2_Stream5_IRQn,
                                           DMA2_Stream6_IRQn,
                                           DMA2_Stream7_IRQn};

// Table of DMAx_Stream_IRQn per DMA engine
static const IRQn_Type *gpDmaStreamIrq[] = {NULL, // This to avoid having to -1 all the time
                                            gDma1StreamIrq,
                                            gDma2StreamIrq};

// Table of functions LL_DMA_ClearFlag_HTx(DMA_TypeDef *DMAx) for each stream.
static const void (*gpLlDmaClearFlagHt[]) (DMA_TypeDef *)  = {LL_DMA_ClearFlag_HT0,
                                                              LL_DMA_ClearFlag_HT1,
                                                              LL_DMA_ClearFlag_HT2,
                                                              LL_DMA_ClearFlag_HT3,
                                                              LL_DMA_ClearFlag_HT4,
                                                              LL_DMA_ClearFlag_HT5,
                                                              LL_DMA_ClearFlag_HT6,
                                                              LL_DMA_ClearFlag_HT7};

// Table of functions LL_DMA_ClearFlag_TCx(DMA_TypeDef *DMAx) for each stream.
static const void (*gpLlDmaClearFlagTc[]) (DMA_TypeDef *)  = {LL_DMA_ClearFlag_TC0,
                                                              LL_DMA_ClearFlag_TC1,
                                                              LL_DMA_ClearFlag_TC2,
                                                              LL_DMA_ClearFlag_TC3,
                                                              LL_DMA_ClearFlag_TC4,
                                                              LL_DMA_ClearFlag_TC5,
                                                              LL_DMA_ClearFlag_TC6,
                                                              LL_DMA_ClearFlag_TC7};

// Table of functions LL_DMA_ClearFlag_TEx(DMA_TypeDef *DMAx) for each stream.
static const void (*gpLlDmaClearFlagTe[]) (DMA_TypeDef *)  = {LL_DMA_ClearFlag_TE0,
                                                              LL_DMA_ClearFlag_TE1,
                                                              LL_DMA_ClearFlag_TE2,
                                                              LL_DMA_ClearFlag_TE3,
                                                              LL_DMA_ClearFlag_TE4,
                                                              LL_DMA_ClearFlag_TE5,
                                                              LL_DMA_ClearFlag_TE6,
                                                              LL_DMA_ClearFlag_TE7};

// Table of functions LL_DMA_ClearFlag_DMEx(DMA_TypeDef *DMAx) for each stream.
static const void (*gpLlDmaClearFlagDme[]) (DMA_TypeDef *)  = {LL_DMA_ClearFlag_DME0,
                                                               LL_DMA_ClearFlag_DME1,
                                                               LL_DMA_ClearFlag_DME2,
                                                               LL_DMA_ClearFlag_DME3,
                                                               LL_DMA_ClearFlag_DME4,
                                                               LL_DMA_ClearFlag_DME5,
                                                               LL_DMA_ClearFlag_DME6,
                                                               LL_DMA_ClearFlag_DME7};

// Table of functions LL_DMA_ClearFlag_FEx(DMA_TypeDef *DMAx) for each stream.
static const void (*gpLlDmaClearFlagFe[]) (DMA_TypeDef *)  = {LL_DMA_ClearFlag_FE0,
                                                              LL_DMA_ClearFlag_FE1,
                                                              LL_DMA_ClearFlag_FE2,
                                                              LL_DMA_ClearFlag_FE3,
                                                              LL_DMA_ClearFlag_FE4,
                                                              LL_DMA_ClearFlag_FE5,
                                                              LL_DMA_ClearFlag_FE6,
                                                              LL_DMA_ClearFlag_FE7};

