u-blox/cellular/port/platform/stm/stm32f4/src/cellular_port_uart.c
// DMA interrupt handler
void dmaIrqHandler(uint32_t dmaEngine, uint32_t dmaStream)
{
    DMA_TypeDef * const pDmaReg = gpDmaReg[dmaEngine];
    CellularPortUartData_t *pUartData = NULL;

    // Check half-transfer complete interrupt
    if (LL_DMA_IsEnabledIT_HT(pDmaReg, dmaStream) &&
        LL_DMA_IsActiveFlag_HT1(pDmaReg)) {
        pUartData = gpDmaUart[dmaEngine + dmaStream];
        // Clear the flag
        gpLlDmaClearFlagHt[dmaStream](pDmaReg);
    }

    // Check transfer complete interrupt
    if (LL_DMA_IsEnabledIT_TC(pDmaReg, dmaStream) &&
        LL_DMA_IsActiveFlag_TC1(pDmaReg)) {
        pUartData = gpDmaUart[dmaEngine + dmaStream];
        // Clear the flag
        gpLlDmaClearFlagTc[dmaStream](pDmaReg);
    }

    if (pUartData != NULL) {
        CellularPortUartEventData_t uartEvent;

        // Stuff has arrived: how much?
        uartEvent = CELLULAR_PORT_UART_RX_BUFFER_SIZE -
                    LL_DMA_GetDataLength(pDmaReg, dmaStream);
        // Move the write pointer on
        pUartData->pRxBufferWrite += uartEvent;
        if (pUartData->pRxBufferWrite >= pUartData->pRxBufferStart +
                                         CELLULAR_PORT_UART_RX_BUFFER_SIZE) {
            pUartData->pRxBufferWrite = pUartData->pRxBufferStart;
        }

        // If the user wanted to know then send a message
        if (pUartData->userNeedsNotify) {
            BaseType_t yield = false;

            xQueueSendFromISR((QueueHandle_t) (pUartData->queue),
                              &uartEvent, &yield);
            pUartData->userNeedsNotify = false;

            // Required for correct FreeRTOS operation
            portEND_SWITCHING_ISR(yield);
        }
    }

}

// UART interrupt handler
void uartIrqHandler(CellularPortUartData_t *pUartData)
{
    const CellularPortUartConstData_t *pUartCfg = pUartData->pConstData;
    USART_TypeDef * const pUartReg = pUartCfg->pReg;

    // Check for IDLE line interrupt
    if (LL_USART_IsEnabledIT_IDLE(pUartReg) &&
        LL_USART_IsActiveFlag_IDLE(pUartReg)) {
        CellularPortUartEventData_t uartEvent;

        // Clear flag
        LL_USART_ClearFlag_IDLE(pUartReg);
        uartEvent = CELLULAR_PORT_UART_RX_BUFFER_SIZE -
                    LL_DMA_GetDataLength(gpDmaReg[pUartCfg->dmaEngine],
                                         pUartCfg->dmaStream);
        // Move the write pointer on
        pUartData->pRxBufferWrite += uartEvent;
        if (pUartData->pRxBufferWrite >= pUartData->pRxBufferStart +
                                         CELLULAR_PORT_UART_RX_BUFFER_SIZE) {
            pUartData->pRxBufferWrite = pUartData->pRxBufferStart;
        }

        // If there is new data and the user wanted to know
        // then send a message to let them know.
        if ((uartEvent > 0) && pUartData->userNeedsNotify) {
            BaseType_t yield = false;

            xQueueSendFromISR((QueueHandle_t) (pUartData->queue),
                              &uartEvent, &yield);
            pUartData->userNeedsNotify = false;

            // Required for correct FreeRTOS operation
            portEND_SWITCHING_ISR(yield);
        }
    }
}

#if CELLULAR_CFG_UART1_AVAILABLE
// USART 1 interrupt handler.
void USART1_IRQHandler()
{
    if (gpUart[1] != NULL) {
        uartIrqHandler(gpUart[1]);
    }
}
#endif

#if CELLULAR_CFG_UART2_AVAILABLE
// USART 2 interrupt handler.
void USART2_IRQHandler()
{
    if (gpUart[2] != NULL) {
        uartIrqHandler(gpUart[2]);
    }
}
#endif

#if CELLULAR_CFG_UART3_AVAILABLE
// USART 3 interrupt handler.
void USART3_IRQHandler()
{
    if (gpUart[3] != NULL) {
        uartIrqHandler(gpUart[3]);
    }
}
#endif

#if CELLULAR_CFG_UART4_AVAILABLE
// UART 4 interrupt handler.
void UART4_IRQHandler()
{
    if (gpUart[4] != NULL) {
        uartIrqHandler(gpUart[4]);
    }
}
#endif

#if CELLULAR_CFG_UART5_AVAILABLE
// UART 5 interrupt handler.
void UART5_IRQHandler()
{
    if (gpUart[5] != NULL) {
        uartIrqHandler(gpUart[5]);
    }
}
#endif

#if CELLULAR_CFG_UART6_AVAILABLE
// USART 6 interrupt handler.
void USART6_IRQHandler()
{
    if (gpUart[6] != NULL) {
        uartIrqHandler(gpUart[6]);
    }
}
#endif

#if CELLULAR_CFG_UART7_AVAILABLE
// UART 7 interrupt handler.
void UART7_IRQHandler()
{
    if (gpUart[7] != NULL) {
        uartIrqHandler(gpUart[7]);
    }
}
#endif

#if CELLULAR_CFG_UART8_AVAILABLE
// UART 8 interrupt handler.
void UART8_IRQHandler()
{
    if (gpUart[8] != NULL) {
        uartIrqHandler(gpUart[8]);
    }
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(1) && CELLULAR_PORT_DMA_STREAM_IN_USE(0)
void DMA1_Stream0_IRQHandler()
{
    dmaIrqHandler(1, 0);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(1) && CELLULAR_PORT_DMA_STREAM_IN_USE(1)
void DMA1_Stream1_IRQHandler()
{
    dmaIrqHandler(1, 1);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(1) && CELLULAR_PORT_DMA_STREAM_IN_USE(2)
void DMA1_Stream2_IRQHandler()
{
    dmaIrqHandler(1, 2);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(1) && CELLULAR_PORT_DMA_STREAM_IN_USE(3)
void DMA1_Stream3_IRQHandler()
{
    dmaIrqHandler(1, 3);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(1) && CELLULAR_PORT_DMA_STREAM_IN_USE(4)
void DMA1_Stream4_IRQHandler()
{
    dmaIrqHandler(1, 4);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(1) && CELLULAR_PORT_DMA_STREAM_IN_USE(5)
void DMA1_Stream5_IRQHandler()
{
    dmaIrqHandler(1, 5);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(1) && CELLULAR_PORT_DMA_STREAM_IN_USE(6)
void DMA1_Stream6_IRQHandler()
{
    dmaIrqHandler(1, 6);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(1) && CELLULAR_PORT_DMA_STREAM_IN_USE(7)
void DMA1_Stream7_IRQHandler()
{
    dmaIrqHandler(1, 7);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(2) && CELLULAR_PORT_DMA_STREAM_IN_USE(0)
void DMA2_Stream0_IRQHandler()
{
    dmaIrqHandler(2, 0);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(2) && CELLULAR_PORT_DMA_STREAM_IN_USE(1)
void DMA2_Stream1_IRQHandler()
{
    dmaIrqHandler(2, 1);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(2) && CELLULAR_PORT_DMA_STREAM_IN_USE(2)
void DMA2_Stream2_IRQHandler()
{
    dmaIrqHandler(2, 2);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(2) && CELLULAR_PORT_DMA_STREAM_IN_USE(3)
void DMA2_Stream3_IRQHandler()
{
    dmaIrqHandler(2, 3);
}
#endif

