u-blox/cellular/port/platform/stm/stm32f4/src/cellular_port_uart.c
#if CELLULAR_PORT_DMA_ENGINE_IN_USE(2) && CELLULAR_PORT_DMA_STREAM_IN_USE(4)
void DMA2_Stream4_IRQHandler()
{
    dmaIrqHandler(2, 4);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(2) && CELLULAR_PORT_DMA_STREAM_IN_USE(5)
void DMA2_Stream5_IRQHandler()
{
    dmaIrqHandler(2, 5);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(2) && CELLULAR_PORT_DMA_STREAM_IN_USE(6)
void DMA2_Stream6_IRQHandler()
{
    dmaIrqHandler(2, 6);
}
#endif

#if CELLULAR_PORT_DMA_ENGINE_IN_USE(2) && CELLULAR_PORT_DMA_STREAM_IN_USE(7)
void DMA2_Stream7_IRQHandler()
{
    dmaIrqHandler(2, 7);
}
#endif

/* ----------------------------------------------------------------
 * PUBLIC FUNCTIONS
 * -------------------------------------------------------------- */

// Initialise a UART.
int32_t cellularPortUartInit(int32_t pinTx, int32_t pinRx,
                             int32_t pinCts, int32_t pinRts,
                             int32_t baudRate,
                             size_t rtsThreshold,
                             int32_t uart,
                             CellularPortQueueHandle_t *pUartQueue)
{
    CellularPortErrorCode_t errorCode = CELLULAR_PORT_INVALID_PARAMETER;
    ErrorStatus platformError;
    CellularPortUartData_t uartData = {0};
    LL_USART_InitTypeDef usartInitStruct = {0};
    LL_GPIO_InitTypeDef gpioInitStruct = {0};
    USART_TypeDef *pUartReg;
    int32_t dmaEngine;
    DMA_TypeDef *pDmaReg;
    int32_t dmaStream;
    int32_t dmaChannel;
    IRQn_Type irq;

    // TODO: use this
    (void) rtsThreshold;

    if ((pUartQueue != NULL) && (pinRx >= 0) && (pinTx >= 0) &&
        (uart > 0) && (uart <= CELLULAR_PORT_MAX_NUM_UARTS) &&
        (baudRate >= 0)) {
        errorCode = CELLULAR_PORT_SUCCESS;
        if (pGetUart(uart) == NULL) {
            // Create the mutex
            errorCode = cellularPortMutexCreate(&(uartData.mutex));
            if (errorCode == 0) {

                CELLULAR_PORT_MUTEX_LOCK(uartData.mutex);

                errorCode = CELLULAR_PORT_OUT_OF_MEMORY;

                uartData.number = uart;
                // Malloc memory for the read buffer
                uartData.pRxBufferStart = (char *) pCellularPort_malloc(CELLULAR_PORT_UART_RX_BUFFER_SIZE);
                if (uartData.pRxBufferStart != NULL) {
                    uartData.pConstData = &(gUartCfg[uart]);
                    uartData.pRxBufferRead = uartData.pRxBufferStart;
                    uartData.pRxBufferWrite = uartData.pRxBufferStart;
                    uartData.userNeedsNotify = true;

                    // Create the queue
                    errorCode = cellularPortQueueCreate(CELLULAR_PORT_UART_EVENT_QUEUE_SIZE,
                                                        sizeof(CellularPortUartEventData_t),
                                                        pUartQueue);
                    if (errorCode == 0) {
                        uartData.queue = *pUartQueue;

                        pUartReg = gUartCfg[uart].pReg;
                        dmaEngine = gUartCfg[uart].dmaEngine;
                        pDmaReg = gpDmaReg[dmaEngine];
                        dmaStream = gUartCfg[uart].dmaStream;
                        dmaChannel = gUartCfg[uart].dmaChannel;
                        irq = gUartCfg[uart].irq;

                        // Now do the platform stuff
                        errorCode = CELLULAR_PORT_PLATFORM_ERROR;

                        // Enable clock to the UART HW block
                        gLlApbClkEnable[uart](gLlApbGrpPeriphUart[uart]);

                        // Enable clock to the DMA HW block (all DMAs
                        // are on bus 1)
                        LL_AHB1_GRP1_EnableClock(gLlApbGrpPeriphDma[dmaEngine]);

                        // Configure the GPIOs
                        // Note, using the LL driver rather than our
                        // driver or the HAL driver here partly because
                        // the example code does that and also
                        // because lower down we need to enable the
                        // UART alternate function for these pins.

                        // Enable clock to the registers for the Tx/Rx pins
                        cellularPortPrivateGpioEnableClock(pinTx);
                        cellularPortPrivateGpioEnableClock(pinRx);
                        // Remember that the Pin field is a bitmap
                        gpioInitStruct.Pin = (1U << CELLULAR_PORT_STM32F4_GPIO_PIN(pinTx)) |
                                             (1U << CELLULAR_PORT_STM32F4_GPIO_PIN(pinRx));
                        gpioInitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
                        gpioInitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
                        // Output type doesn't matter, it is overridden by
                        // the alternate function
                        gpioInitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
                        gpioInitStruct.Pull = LL_GPIO_PULL_UP;
                        gpioInitStruct.Alternate = gGpioAf[uart];
                        platformError = LL_GPIO_Init(pCellularPortPrivateGpioGetReg(pinTx),
                                                     &gpioInitStruct);

                        //  Configure RTS if present
                        if ((pinRts >= 0) && (platformError == SUCCESS)) {
                            cellularPortPrivateGpioEnableClock(pinRts);
                            gpioInitStruct.Pin = 1U << CELLULAR_PORT_STM32F4_GPIO_PIN(pinRts);
                            platformError = LL_GPIO_Init(pCellularPortPrivateGpioGetReg(pinRts),
                                                         &gpioInitStruct);
                        }

                        //  Configure CTS if present
                        if ((pinCts >= 0) && (platformError == SUCCESS)) {
                            cellularPortPrivateGpioEnableClock(pinCts);
                            gpioInitStruct.Pin = 1U << CELLULAR_PORT_STM32F4_GPIO_PIN(pinCts);
                            // TODO: the u-blox C030-R412M board requires a pull-down here
                            gpioInitStruct.Pull = LL_GPIO_PULL_DOWN;
                            platformError = LL_GPIO_Init(pCellularPortPrivateGpioGetReg(pinCts),
                                                         &gpioInitStruct);
                        }

                        // Configure DMA
                        if (platformError == SUCCESS) {
                            // Channel CELLULAR_CFG_DMA_CHANNEL on our DMA/Stream
                            LL_DMA_SetChannelSelection(pDmaReg, dmaStream, dmaChannel);
                            // Towards RAM
                            LL_DMA_SetDataTransferDirection(pDmaReg, dmaStream,
                                                            LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
                            // Low priority
                            LL_DMA_SetStreamPriorityLevel(pDmaReg, dmaStream,
                                                          LL_DMA_PRIORITY_LOW);
                            // Circular
                            LL_DMA_SetMode(pDmaReg, dmaStream, LL_DMA_MODE_CIRCULAR);
                            // Byte-wise transfers
                            LL_DMA_SetPeriphIncMode(pDmaReg, dmaStream,
                                                    LL_DMA_PERIPH_NOINCREMENT);
                            LL_DMA_SetMemoryIncMode(pDmaReg, dmaStream,
                                                    LL_DMA_MEMORY_INCREMENT);
                            LL_DMA_SetPeriphSize(pDmaReg, dmaStream,
                                                 LL_DMA_PDATAALIGN_BYTE);
                            LL_DMA_SetMemorySize(pDmaReg, dmaStream,
                                                 LL_DMA_MDATAALIGN_BYTE);
                            // Not FIFO mode, whatever that is
                            LL_DMA_DisableFifoMode(pDmaReg, dmaStream);

