u-blox/cellular/port/platform/stm/stm32f4/src/cellular_port_uart.c
                            // Attach the DMA to the UART at one end
                            LL_DMA_SetPeriphAddress(pDmaReg, dmaStream,
                                                    (uint32_t) (pUartReg->DR));

                            // ...and to the RAM buffer at the other end
                            LL_DMA_SetMemoryAddress(pDmaReg, dmaStream,
                                                    (uint32_t) (uartData.pRxBufferStart));
                            LL_DMA_SetDataLength(pDmaReg, dmaStream,
                                                 CELLULAR_PORT_UART_RX_BUFFER_SIZE);

                            // Set DMA priority
                            NVIC_SetPriority(gpDmaStreamIrq[dmaEngine][dmaStream],
                                             NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 5, 0));

                            // Clear all the DMA flags and the DMA pending IRQ from any previous
                            // session first, or an unexpected interrupt may result
                            gpLlDmaClearFlagHt[dmaStream](pDmaReg);
                            gpLlDmaClearFlagTc[dmaStream](pDmaReg);
                            gpLlDmaClearFlagTe[dmaStream](pDmaReg);
                            gpLlDmaClearFlagDme[dmaStream](pDmaReg);
                            gpLlDmaClearFlagFe[dmaStream](pDmaReg);
                            NVIC_ClearPendingIRQ(gpDmaStreamIrq[dmaEngine][dmaStream]);

                            // Enable half full and transmit complete interrupts
                            LL_DMA_EnableIT_HT(pDmaReg, dmaStream);
                            LL_DMA_EnableIT_TC(pDmaReg, dmaStream);

                            // Go!
                            NVIC_EnableIRQ(gpDmaStreamIrq[dmaEngine][dmaStream]);

                            // Initialise the USART
                            usartInitStruct.BaudRate = baudRate;
                            usartInitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
                            usartInitStruct.StopBits = LL_USART_STOPBITS_1;
                            usartInitStruct.Parity = LL_USART_PARITY_NONE;
                            usartInitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
                            // TODO: need to connect flow control to DMA?
                            usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
                            if ((pinRts >= 0) && (pinCts >= 0)) {
                                usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_RTS_CTS;
                            } else {
                                if (pinRts >= 0) {
                                    usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_RTS;
                                } else {
                                    usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_CTS;
                                }
                            }
                            usartInitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
                            platformError = LL_USART_Init(pUartReg, &usartInitStruct);
                        }

                        // STILL more stuff to configure...
                        if (platformError == SUCCESS) {
                            LL_USART_ConfigAsyncMode(pUartReg);
                            LL_USART_EnableDMAReq_RX(pUartReg);
                            LL_USART_EnableIT_IDLE(pUartReg);

                            // Enable USART interrupt
                            NVIC_SetPriority(irq,
                                             NVIC_EncodePriority(NVIC_GetPriorityGrouping(),
                                                                 5, 1));
                            NVIC_ClearPendingIRQ(irq);
                            NVIC_EnableIRQ(irq);

                            // Enable USART and DMA
                            LL_DMA_EnableStream(pDmaReg, dmaStream);
                            LL_USART_Enable(pUartReg);
                        }

                        // Finally, add the UART to the list
                        if (platformError == SUCCESS) {
                            errorCode = CELLULAR_PORT_OUT_OF_MEMORY;
                            if (pAddUart(uart, &uartData) != NULL) {
                                errorCode = CELLULAR_PORT_SUCCESS;
                            }
                        }
                    }
                }

                CELLULAR_PORT_MUTEX_UNLOCK(uartData.mutex);

                // If we failed, clean up
                if (errorCode != 0) {
                    cellularPortMutexDelete(uartData.mutex);
                    cellularPort_free(uartData.pRxBufferStart);
                }
            }
        }
    }

    return (int32_t) errorCode;
}

// Shutdown a UART.
int32_t cellularPortUartDeinit(int32_t uart)
{
    CellularPortErrorCode_t errorCode = CELLULAR_PORT_INVALID_PARAMETER;
    CellularPortUartData_t *pUartData;
    USART_TypeDef *pUartReg;
    int32_t dmaEngine;
    int32_t dmaStream;

    if ((uart > 0) && (uart <= CELLULAR_PORT_MAX_NUM_UARTS)) {
        pUartData = pGetUart(uart);
        errorCode = CELLULAR_PORT_SUCCESS;
        if (pUartData != NULL) {

            errorCode = CELLULAR_PORT_PLATFORM_ERROR;
            pUartReg = gUartCfg[uart].pReg;
            dmaEngine = gUartCfg[uart].dmaEngine;
            dmaStream = gUartCfg[uart].dmaStream;
            // No need to lock the mutex, we need to delete it
            // and we're not allowed to delete a locked mutex.
            // The caller needs to make sure that no read/write
            // is in progress when this function is called.

            // TODO check this

            // Disable DMA interrupt
            NVIC_DisableIRQ(gpDmaStreamIrq[dmaEngine][dmaStream]);

            // Disable USART interrupt
            NVIC_DisableIRQ(gUartCfg[uart].irq);
            // Disable DMA and USART
            LL_DMA_DisableStream(gpDmaReg[dmaEngine], dmaStream);
            LL_USART_Disable(pUartReg);
            LL_USART_DeInit(pUartReg);

            // Delete the queue
            cellularPortQueueDelete(pUartData->queue);
            // Free the buffer
            cellularPort_free(pUartData->pRxBufferStart);
            // Delete the mutex
            cellularPortMutexDelete(pUartData->mutex);
            // And finally remove the UART from the list
            removeUart(uart);
            errorCode = CELLULAR_PORT_SUCCESS;
        }
    }

    return (int32_t) errorCode;
}

// Push a UART event onto the UART event queue.
int32_t cellularPortUartEventSend(const CellularPortQueueHandle_t queueHandle,
                                  int32_t sizeBytes)
{
    int32_t errorCode = CELLULAR_PORT_INVALID_PARAMETER;
    CellularPortUartEventData_t uartEvent;

    if (queueHandle != NULL) {
        uartEvent = sizeBytes;
        errorCode = cellularPortQueueSend(queueHandle, (void *) &uartEvent);
    }

    return errorCode;
}

// Receive a UART event, blocking until one turns up.
int32_t cellularPortUartEventReceive(const CellularPortQueueHandle_t queueHandle)
{
    int32_t sizeOrErrorCode = CELLULAR_PORT_INVALID_PARAMETER;
    CellularPortUartEventData_t uartEvent;

    if (queueHandle != NULL) {
        sizeOrErrorCode = CELLULAR_PORT_PLATFORM_ERROR;
        if (cellularPortQueueReceive(queueHandle, &uartEvent) == 0) {
            sizeOrErrorCode = uartEvent;
        }
    }

    return sizeOrErrorCode;
}

// Get the number of bytes waiting in the receive buffer.
int32_t cellularPortUartGetReceiveSize(int32_t uart)
{
    CellularPortErrorCode_t sizeOrErrorCode = CELLULAR_PORT_INVALID_PARAMETER;
    CellularPortUartData_t *pUartData = pGetUart(uart);
    const volatile char *pRxBufferWrite;

